Revit 2024 API
FaceDetailNode.GetLinkTransform Method
 Returns link transform of the object being drawn.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public Transform GetLinkTransform()
Visual Basic
Public Function GetLinkTransform As Transform
Visual C++
public:
Transform^ GetLinkTransform()
See Also
FaceDetailNode Class
Autodesk.Revit.DB Namespace